{
	"id": "the-starlit-backpack",
	"title": "The Starlit Backpack",
	"cover": "/books/the-starlit-backpack/cover.jpg",
	"ageRange": "4-8",
	"description": "A cozy, imaginative tale about a backpack that glows with tiny stars and takes its owner on gentle, nighttime adventures.",
	"pages": [
		{
			"page": 1,
			"text": "Luna loved the stars. Every night, she sat by her window and whispered wishes to the sky.",
			"illustration": "A cozy bedroom bathed in moonlight. Luna, a curious child in pajamas, sits by the window with glowing stars above and a soft night breeze lifting the curtains."
		},
		{
			"page": 2,
			"text": "One evening, she found a backpack waiting by her bed — deep brown, soft as moonlight, and dotted with tiny, glowing stars.",
			"illustration": "A glowing backpack sits beside Luna’s bed, illuminating the room in warm golden light. A small lantern and a journal rest nearby."
		},
		{
			"page": 3,
			"text": "A note peeked out from under the flap: 'For dreamers and star-watchers. Pack your heart, and the night will guide you.'",
			"illustration": "A close-up of the note on parchment paper, the handwriting curling like constellations. The backpack twinkles faintly in the background."
		},
		{
			"page": 4,
			"text": "Luna gently opened the backpack — and the stars inside began to shimmer brighter, as if happy to see her.",
			"illustration": "A swirl of starlight lifting from the open bag, surrounding Luna with tiny glowing stars that float like fireflies."
		},
		{
			"page": 5,
			"text": "“Where should we go?” she whispered. The stars twinkled in answer, forming a sparkling trail out the window.",
			"illustration": "Stars flow from the window into the night, forming a glowing pathway over a quiet landscape."
		},
		{
			"page": 6,
			"text": "With a deep breath, Luna climbed onto the starlit trail — and up, up she went, the backpack warm against her shoulders.",
			"illustration": "Luna walking or floating gently along a ribbon of stars, the night sky full of purples and golds."
		},
		{
			"page": 7,
			"text": "She floated over forests where owls blinked sleepily and rivers shimmered like silver threads.",
			"illustration": "A wide scene of the forest below, with glowing rivers and softly glowing animals looking up at Luna."
		},
		{
			"page": 8,
			"text": "Then, she saw something marvelous — a mountain of moonlight, crowned with glowing flowers.",
			"illustration": "A shining, pale mountain surrounded by flowers that emit soft light. Luna looks on in wonder."
		},
		{
			"page": 9,
			"text": "Each flower hummed a lullaby, soft as the wind. Luna picked one and tucked it into her backpack.",
			"illustration": "Luna kneeling to pick a luminous flower, her backpack glowing brighter as it accepts it."
		},
		{
			"page": 10,
			"text": "Farther on, she reached a lake so still it reflected every star in the sky — and one special star winked right at her.",
			"illustration": "A glowing lake mirroring the entire sky, Luna kneeling at its edge, her reflection surrounded by starlight."
		},
		{
			"page": 11,
			"text": "“Hello, little one,” said the star. “We’ve been waiting for you.”",
			"illustration": "A small, smiling star rising from the lake’s surface, illuminating Luna’s curious face."
		},
		{
			"page": 12,
			"text": "“We need your help,” said the star. “A piece of the night has gone missing.”",
			"illustration": "The star points toward the horizon where a dark patch interrupts the glowing sky."
		},
		{
			"page": 13,
			"text": "Luna looked inside her backpack. “Maybe the stars inside can help,” she said.",
			"illustration": "Luna opening her backpack — dozens of tiny stars peeking out eagerly, ready to help."
		},
		{
			"page": 14,
			"text": "She tossed them gently into the sky, one by one, and they flew to fill the empty space.",
			"illustration": "Stars spiraling upward, restoring the dark patch to a glowing constellation."
		},
		{
			"page": 15,
			"text": "When the last star was placed, the sky shimmered brighter than ever before.",
			"illustration": "A radiant sky full of new constellations; Luna stands bathed in light, the star beside her smiling."
		},
		{
			"page": 16,
			"text": "“Thank you, Luna,” said the star. “Now the night can dream again.”",
			"illustration": "The little star bows in gratitude before drifting back into the heavens."
		},
		{
			"page": 17,
			"text": "Luna yawned. The backpack glowed warmly, guiding her home.",
			"illustration": "Luna floating gently back down through the stars, her backpack twinkling like a lantern."
		},
		{
			"page": 18,
			"text": "When she woke, the backpack was by her bed again — quiet and still, but with a faint golden shimmer.",
			"illustration": "Morning light streams into Luna’s room; the backpack rests calmly beside her bed, one tiny star still glowing."
		},
		{
			"page": 19,
			"text": "Luna smiled. She opened her window and whispered, “Thank you for the adventure.”",
			"illustration": "Luna gazing at the morning sky, the moon faintly visible, stars fading into the dawn."
		},
		{
			"page": 20,
			"text": "And from far away, a single star twinkled back — as if to say, “Until next time.”",
			"illustration": "A dreamy final image of the wide sky, one bright star shining above a peaceful landscape. The backpack’s faint glow can be seen in the corner — waiting for the next journey."
		}
	]
}
