{
	"id": "zoe-and-the-zigzag",
	"title": "Zoe and the Zigzag",
	"cover": "@/assets/books/zoe-and-the-zigzag/cover.jpg",
	"ageRange": "3-6",
	"description": "Zoe draws a zigzag that comes to life and takes her on a creative day of doodles and play.",
	"pages": [
		{
			"page": 1,
			"text": "Zoe loved to draw. Her crayons danced across the paper in swirls, loops, and squiggles.",
			"illustration": "Zoe at her art table surrounded by crayons, smiling as colorful doodles fill the page."
		},
		{
			"page": 2,
			"text": "One day, she drew a bright yellow zigzag—zig! zag!—and something amazing happened.",
			"illustration": "A glowing yellow zigzag appears on Zoe’s paper, shimmering with magical light."
		},
		{
			"page": 3,
			"text": "The zigzag lifted off the page! It wiggled, it jiggled, it giggled!",
			"illustration": "The glowing zigzag floats above Zoe’s drawing pad, twinkling as Zoe gasps in surprise."
		},
		{
			"page": 4,
			"text": "“Hi, Zigzag!” said Zoe. “Let’s play!” The zigzag twirled in the air like a happy noodle.",
			"illustration": "Zoe waves as the zigzag loops around her, leaving sparkly trails through the air."
		},
		{
			"page": 5,
			"text": "They zipped around the room, drawing rainbows and stars wherever they went.",
			"illustration": "Zoe and the zigzag zooming through her colorful bedroom, painting stars on the walls."
		},
		{
			"page": 6,
			"text": "Then—POP!—the zigzag bounced out the window into the big blue sky!",
			"illustration": "The zigzag whooshes through an open window while Zoe leans out, wide-eyed and smiling."
		},
		{
			"page": 7,
			"text": "Zoe grabbed her crayons and ran outside. She followed the glowing trail through the park.",
			"illustration": "Zoe running across a sunny park, following the bright, wiggly line floating ahead."
		},
		{
			"page": 8,
			"text": "The zigzag swooshed around a tree, turning its leaves into glittering shapes.",
			"illustration": "A tree sparkling with zigzag patterns while Zoe watches in wonder, holding her sketchbook."
		},
		{
			"page": 9,
			"text": "It zipped past the playground, painting the slide in stripes of every color!",
			"illustration": "Children laughing as the zigzag colors the slide rainbow-bright while Zoe cheers."
		},
		{
			"page": 10,
			"text": "“Wait for me!” giggled Zoe as she chased the glowing line up a hill.",
			"illustration": "Zoe climbing a green hill at sunset, the zigzag twinkling ahead like lightning made of fun."
		},
		{
			"page": 11,
			"text": "At the top, the zigzag danced in the air, drawing a big yellow sun that shimmered and spun.",
			"illustration": "The zigzag sketching a radiant sun over the hilltop while Zoe gazes up, amazed."
		},
		{
			"page": 12,
			"text": "“You’re amazing!” Zoe said. The zigzag made a little bow and a silly squiggle.",
			"illustration": "Zoe laughing as the zigzag bends into a bow shape, surrounded by sparkly doodles."
		},
		{
			"page": 13,
			"text": "But then, the zigzag began to fade. Its glow flickered softly, like a sleepy firefly.",
			"illustration": "The zigzag’s light dimming as Zoe looks on, holding her crayon gently."
		},
		{
			"page": 14,
			"text": "“Oh no,” whispered Zoe. “Are you tired?” The zigzag drooped and made a tiny zig…zag…",
			"illustration": "Zoe kneeling beside the faintly glowing zigzag, her face full of care and concern."
		},
		{
			"page": 15,
			"text": "Zoe opened her crayon box and drew a cozy blanket of stars around her friend.",
			"illustration": "Zoe coloring a glowing blanket of stars around the sleepy zigzag as it snuggles in."
		},
		{
			"page": 16,
			"text": "The zigzag sparkled once more, curling into a gentle heart shape.",
			"illustration": "A glowing heart made of the zigzag’s light, floating softly beside Zoe’s hand."
		},
		{
			"page": 17,
			"text": "“Time to rest,” Zoe whispered. “We can draw again tomorrow.”",
			"illustration": "Zoe smiling sleepily, the zigzag fading into her drawing as twilight falls."
		},
		{
			"page": 18,
			"text": "That night, Zoe dreamed of shapes that danced and colors that sang.",
			"illustration": "Zoe sleeping peacefully, surrounded by dreamlike swirls of doodles and stars."
		},
		{
			"page": 19,
			"text": "In her dream, the zigzag waved from the sky, leaving trails that spelled her name.",
			"illustration": "The zigzag writing 'ZOE' in glowing letters across a starlit dream sky."
		},
		{
			"page": 20,
			"text": "When Zoe woke up, her crayons shimmered softly. The adventure was just beginning.",
			"illustration": "Morning light shining on Zoe’s art table with a faint golden zigzag glowing across the page."
		}
	]
}
